{
	"versions": [{
			"Version": "4.2",
			"URL": "https:\/\/www.icloud.com\/shortcuts\/4fc71e10dc9c456aab54ffee1f5dc864",
			"Release": "April 14, 2023",
			"Notes": "A considerable flaw was spotted that was limiting the success rate if a user was seeking a flavor for date over 1 year ago. I imagine few are going back that far, if any, but I went ahead and fixed it anyway. This change also warranted an adjustment within the flow related to holidays. Lastly, made minor tweaks to verbiage."
		},{
			"Version": "4.0",
			"URL": "https:\/\/www.icloud.com\/shortcuts\/bec050c48e564bcaa9f8d1380434e94f",
			"Release": "December 3, 2022",
			"Notes": "This is the first official iOS 16 approved version, though the previous version should have been working fine. Other changes: 1) If the Shortcut returns no flavor, the error message should show the Flavor of the Day on the same day 1 year prior. Super fun. 2) If the Shortcut is ran on a holiday when Goodberry's is not open (Thanksgiving and Christmas), the holiday message will include the Flavor of the Day for the following day. 3) There is a new variable to designate whether the shortcut should use the Current Date when it is ran, or if the user should specify the date each time the shortcut is ran. It's defaulted to Current Date, but a Setup prompt will allow the user to change to Specify Date if desirable. 4) Various changes to verbiage throughout the shortcut."
		},
		{
			"Version": "3.2",
			"URL": "https:\/\/www.icloud.com\/shortcuts\/79a5cbbba1e9437bb615af76b20b8b8a",
			"Release": "August 19, 2022",
			"Notes": "Important update. I noticed a flaw in the new API logic that would have made it difficult to add the next month's flavor before the month begins. This update should accommodate that scenario, gracefully, going forward."
		},
		{
			"Version": "3.1",
			"URL": "https:\/\/www.icloud.com\/shortcuts\/64c31188eda44d28b723f8bc403bdfaa",
			"Release": "August 18, 2022",
			"Notes": "RoutineHub's uptime has become a bit unreliable, so the Shortcut has been updated so that it checks for new versions from Github. I'll continue to maintain RoutineHub, as well, and may move the version checker function back to RoutineHub if performance improves."
		},
		{
			"Version": "3.0",
			"URL": "https:\/\/www.icloud.com\/shortcuts\/e16a419b89ea4339a22776aa9bd80148",
			"Release": "August 17, 2022",
			"Notes": "My previous method of getting the Flavor of the Day, via Google Calendar HTML, failed me. A new Github page has been configured, and the Flavor of the Day is now sourced from a REST API on that page."
		}
	]
}
